Tekla.Structures.DialogInternal.CoreInpDialogInterface.profileCallback
The profile attribute selection callback

Tekla.Structures.DialogInternal.CoreInpDialogInterface.ProfileAttributeRequestedEvent
The profile attribute requested event

Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedCallback(System.IntPtr,System.String,System.Int32)
Profile catalog callback function to be called from native INP dialog
handle: Native dialog handle
profile: Profile name
flag: The dummy flag
Returns: 1, always